Repo/tITP/tITP_test/0/ampholyte.PROPIONIC_ACID
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v3.0+                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 FoamFile{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ampholyte.PROPIONIC_ACID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 dimensions      [0 -3 0 0 1 0 0];

 internalField  nonuniform List<scalar>
5000
 (
0.7761257465592432
 0.91543374582087
 1.0759169811909854
 1.2600443138909776
 1.4704372903671061
 1.7098558088193474
 1.9811788129950028
 2.287379698652745
...
)
;

boundaryField
{
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            inletOutlet;
 inletValue           uniform 00.0;
    phi             flux;
   }
 outlet
    {
        type            inletOutlet;
 inletValue           uniform 50.0;
    phi             flux;
   }

    axis    {
        type            empty;
    }
}
