Repo/tITP/tITP_test/constant/electrolytes.txt
4 0.001 0.99 0 0
PROPIONIC_ACID 00.0 50.0 50.0          
HISTIDINE    00.0 100.0 100.0          
ASPARTIC_ACID    0.05 0.0  0.0
GLUTAMIC_ACID   0.05 0.0 0.0
k1 0 0 1 2 3
A                 3.33e-7 0. 0. 
T                 -1 -1 -1  1.323e-6 0.0267 4e-4         
AT                0.0 0.0 0.0           
k1 1.21831 1.75e-3 4 5 6
